---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarReinforcementData.RebarId
source: html/a7d48b45-185b-096e-08b6-9c14efabe633.htm
---
# Autodesk.Revit.DB.Structure.RebarReinforcementData.RebarId Property

The id of the Rebar

## Syntax (C#)
```csharp
public ElementId RebarId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null